OpenFOAM/4.x/ERCOFTAC-SIG15/case13.1/alpha_0/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        //        type            fixedValue;
        type                mapped;
        interpolationScheme cell;
        setAverage          true;
        average             (-8.7 0 0);
        value           uniform (-8.7 0 0);
    }
    outlet
    {
        type            zeroGradient;
    }
    slip
    {
        type            slip;
    }
    rotaingWall
    {
        type            rotatingWallVelocity;
        origin          (0 0 0);
        axis            (1 0 0);
        omega           0;
        value           uniform (0 -0 0);
    }
    inletWall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    back
    {
        type            wedge;
    }
    front
    {
        type            wedge;
    }
}


// ************************************************************************* //
