OpenFOAM/4.x/ERCOFTAC-SIG15/case13.1/alpha_0/system/functionMinMax
    MinMax
    {
        type            fieldMinMax;
        libs ("libfieldFunctionObjects.so");
        enabled         true;
        log             true;
        write           true;
	writeControl    timeStep;
	writeInterval   1;
        fields
        (
            U
            p
	    k
	    epsilon
	    omega
        );
    }
